[
  {
    "id": 1,
    "content": "An insightful visit to Anokha TechFair where learning truly went beyond classrooms. Interacting with students, understanding their ideas, and seeing practical implementations made the experience engaging and meaningful. It was refreshing to see how concepts are transformed into real solutions through teamwork and innovation.",
    "hashtags": [
      "AnokhaTechFair",
      "IIC",
      "AmritaVishwaVidyapeethamCoimbatore",
      "LearningByDoing",
      "CampusInnovation"
    ]
  },
  {
    "id": 2,
    "content": "Visited Anokha TechFair and explored several student-led projects addressing real-world challenges. The clarity with which teams explained their design choices and implementation strategies made the experience both informative and inspiring. A strong example of hands-on, project-driven learning.",
    "hashtags": [
      "AnokhaTechFair",
      "IIC",
      "AmritaVishwaVidyapeethamCoimbatore",
      "HandsOnLearning",
      "StudentInnovation"
    ]
  },
  {
    "id": 3,
    "content": "An enriching experience at Anokha TechFair where theory clearly met practice. The projects reflected strong problem-solving approaches, collaboration, and a genuine innovation mindset. Overall, a valuable exposure to applied engineering and creative thinking.",
    "hashtags": [
      "AnokhaTechFair",
      "IIC",
      "AmritaVishwaVidyapeethamCoimbatore",
      "InnovationJourney",
      "PracticalLearning"
    ]
  },
  {
    "id": 4,
    "content": "Explored Anokha TechFair and gained meaningful insights into student research and prototype development. The way teams discussed their challenges, iterations, and outcomes showed strong design thinking and clarity of thought. A very engaging learning experience.",
    "hashtags": [
      "AnokhaTechFair",
      "IIC",
      "AmritaVishwaVidyapeethamCoimbatore",
      "DesignThinking",
      "StudentResearch"
    ]
  },
  {
    "id": 5,
    "content": "Anokha TechFair offered a great platform to witness innovation in action. From early ideas to working prototypes, the projects demonstrated effort, experimentation, and purpose-driven learning. The overall environment encouraged curiosity and exploration.",
    "hashtags": [
      "AnokhaTechFair",
      "IIC",
      "AmritaVishwaVidyapeethamCoimbatore",
      "InnovationInAction",
      "EngineeringInnovation"
    ]
  },
  {
    "id": 6,
    "content": "Visited Anokha TechFair and interacted with teams working on smart and practical solutions. The hands-on nature of the projects made the experience engaging and easy to relate to real-world applications. A productive and inspiring visit.",
    "hashtags": [
      "AnokhaTechFair",
      "IIC",
      "AmritaVishwaVidyapeethamCoimbatore",
      "AppliedTechnology",
      "SkillDevelopment"
    ]
  },
  {
    "id": 7,
    "content": "An insightful visit that highlighted the importance of project-based learning and teamwork. Anokha TechFair clearly provides students a space to experiment, build, and learn through real projects. A strong example of applied education.",
    "hashtags": [
      "AnokhaTechFair",
      "IIC",
      "AmritaVishwaVidyapeethamCoimbatore",
      "ProjectBasedLearning",
      "Teamwork"
    ]
  },
  {
    "id": 8,
    "content": "Spent time at Anokha TechFair exploring a variety of innovative student projects. The discussions and demonstrations helped in understanding how ideas evolve through experimentation and collaboration. Overall, a well-curated innovation space.",
    "hashtags": [
      "AnokhaTechFair",
      "IIC",
      "AmritaVishwaVidyapeethamCoimbatore",
      "InnovationCulture",
      "CampusLife"
    ]
  },
  {
    "id": 9,
    "content": "An engaging visit to Anokha TechFair where student creativity and technical skills stood out clearly. The projects reflected strong practical learning and relevance to real-world problems. A meaningful and motivating experience.",
    "hashtags": [
      "AnokhaTechFair",
      "IIC",
      "AmritaVishwaVidyapeethamCoimbatore",
      "EngineeringStudents",
      "InnovationMindset"
    ]
  },
  {
    "id": 10,
    "content": "Explored Anokha TechFair and was impressed by the research-oriented approach of several projects. The event encouraged curiosity, questioning, and applied thinking among students. A valuable exposure to innovation-driven learning.",
    "hashtags": [
      "AnokhaTechFair",
      "IIC",
      "AmritaVishwaVidyapeethamCoimbatore",
      "ResearchCulture",
      "AppliedLearning"
    ]
  },
  {
    "id": 11,
    "content": "An enriching exposure to student-built solutions and innovation-focused learning at Anokha TechFair. The experience clearly showed how learning beyond textbooks builds confidence and skills. A well-organized and impactful event.",
    "hashtags": [
      "AnokhaTechFair",
      "IIC",
      "AmritaVishwaVidyapeethamCoimbatore",
      "LearningBeyondClassroom",
      "StudentExcellence"
    ]
  },
  {
    "id": 12,
    "content": "Visited Anokha TechFair and gained insight into how students approach problem identification and idea validation. The structured explanations and practical demonstrations made the experience informative and engaging.",
    "hashtags": [
      "AnokhaTechFair",
      "IIC",
      "AmritaVishwaVidyapeethamCoimbatore",
      "ProblemSolving",
      "AcademicInnovation"
    ]
  },
  {
    "id": 13,
    "content": "Anokha TechFair served as a strong platform for collaborative learning and idea exchange. The enthusiasm and teamwork among participants made the experience motivating and inspiring. A meaningful exposure to innovation culture.",
    "hashtags": [
      "AnokhaTechFair",
      "IIC",
      "AmritaVishwaVidyapeethamCoimbatore",
      "CollaborativeInnovation",
      "InnovationCommunity"
    ]
  },
  {
    "id": 14,
    "content": "An insightful visit where technology, creativity, and teamwork came together seamlessly. Anokha TechFair truly reflects the evolving direction of engineering education and innovation.",
    "hashtags": [
      "AnokhaTechFair",
      "IIC",
      "AmritaVishwaVidyapeethamCoimbatore",
      "FutureOfTech",
      "TechCreators"
    ]
  },
  {
    "id": 15,
    "content": "A rewarding visit to Anokha TechFair that showcased the power of learning through building and experimentation. An inspiring environment for students to grow, innovate, and create meaningful impact.",
    "hashtags": [
      "AnokhaTechFair",
      "IIC",
      "AmritaVishwaVidyapeethamCoimbatore",
      "InnovationJourney",
      "BuildTheFuture"
    ]
  },
  {
    "id": 16,
    "content": "Visiting Anokha TechFair was a refreshing experience that showcased how innovation thrives in an academic environment. Observing students confidently present their work and explain the impact of their projects highlighted the importance of experiential learning. A well-structured platform that truly supports creativity and technical growth.",
    "hashtags": [
      "AnokhaTechFair",
      "IIC",
      "AmritaVishwaVidyapeethamCoimbatore",
      "ExperientialLearning",
      "InnovationCulture"
    ]
  },
  {
    "id": 17,
    "content": "An engaging experience at Anokha TechFair that provided a closer look at student-driven innovation. The projects reflected thoughtful problem identification, clear execution, and strong teamwork. Overall, a meaningful exposure to applied engineering and collaborative learning.",
    "hashtags": [
      "AnokhaTechFair",
      "IIC",
      "AmritaVishwaVidyapeethamCoimbatore",
      "AppliedEngineering",
      "Teamwork"
    ]
  },
  {
    "id": 18,
    "content": "Exploring Anokha TechFair offered valuable insight into how students approach real-world challenges through technology. The structured explanations and practical demonstrations made the visit informative and impactful. A great example of learning through active participation.",
    "hashtags": [
      "AnokhaTechFair",
      "IIC",
      "AmritaVishwaVidyapeethamCoimbatore",
      "HandsOnLearning",
      "PracticalExposure"
    ]
  },
  {
    "id": 19,
    "content": "Anokha TechFair created a space where ideas, experimentation, and collaboration came together effectively. Interacting with project teams and understanding their development process made the experience insightful. A strong reflection of innovation-led academic culture.",
    "hashtags": [
      "AnokhaTechFair",
      "IIC",
      "AmritaVishwaVidyapeethamCoimbatore",
      "InnovationDriven",
      "CampusInnovation"
    ]
  },
  {
    "id": 20,
    "content": "A thoughtful and engaging visit to Anokha TechFair that highlighted student creativity and technical competence. The event encouraged discussion, curiosity, and knowledge sharing across disciplines. An inspiring initiative that supports innovation at every stage.",
    "hashtags": [
      "AnokhaTechFair",
      "IIC",
      "AmritaVishwaVidyapeethamCoimbatore",
      "KnowledgeSharing",
      "StudentInnovation"
    ]
  }
]